Select query with LEFT/RIGHT/FULL JOINs on multiple tables
SELECT column, another_column, …
FROM mytable
INNER/LEFT/RIGHT/FULL JOIN another_table 
    ON mytable.id = another_table.matching_id
WHERE condition(s)
ORDER BY column, … ASC/DESC
LIMIT num_limit OFFSET num_offset;

In [1]:
import pandas as pd

In [2]:
import sqlite3
conn = sqlite3.connect('test.db')
print("Opened database successfully")

Opened database successfully

In [3]:
# Create Table
conn.execute('''CREATE TABLE IF NOT EXISTS buildings
         (building_name TEXT, 
         capacity INT);''')

print("Table created Successfully")

Table created Successfully

In [4]:
df = pd.read_csv('04_table_buildings.csv', sep='\t')
df.head()

  Building_name  Capacity
0            1e        24
1            1w        32
2            2e        16
3            2w        20

In [5]:
ret = df.to_sql('buildings', conn, if_exists='replace', index=False)
print(ret, " Rows inserted into table")

4  Rows inserted into table

In [6]:
# Create Table
conn.execute('''CREATE TABLE IF NOT EXISTS employees
         (role TEXT,
         name TEXT,
         building TEXT,
         years_employed int);''')

print("Table created Successfully")

Table created Successfully

In [7]:
df = pd.read_csv('05_table_employees.csv', sep='\t')
df.head()

       Role       Name Building  Years_employed
0  Engineer   Becky A.       1e               4
1  Engineer     Dan B.       1e               2
2  Engineer  Sharon F.       1e               6
3  Engineer     Dan M.       1e               4
4  Engineer  Malcom S.       1e               1

In [8]:
ret = df.to_sql('employees', conn, if_exists='replace', index=False)
print(ret, " Rows inserted into table")

13  Rows inserted into table

Find the list of all buildings that have employees

In [9]:
ret = conn.execute('''SELECT DISTINCT building FROM employees;''')
for r in ret:
    print(r)

('1e',)
('2w',)

List all buildings and the distinct employee roles in each building (including empty buildings)

In [10]:
ret = conn.execute('''SELECT DISTINCT building_name, role 
    FROM buildings 
    LEFT JOIN employees 
    ON building_name = building;''')
for r in ret:
    print(r)

('1e', 'Engineer')
('1e', 'Manager')
('1w', None)
('2e', None)
('2w', 'Artist')
('2w', 'Manager')

Find the list of all buildings and their capacity

In [11]:
ret = conn.execute('''SELECT * FROM buildings''')
for r in ret:
    print(r)

('1e', 24)
('1w', 32)
('2e', 16)
('2w', 20)

In [ ]:
conn.close()